###############################################################################
# Created by write_sdc
# Tue Nov  7 16:51:09 2023
###############################################################################
current_design sar_adc
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 20.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {analog_dac_out}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {analog_din[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {analog_din[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {analog_din[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {analog_din[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {analog_din[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {analog_din[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pulse1m_mclk}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_addr[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_addr[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_addr[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_addr[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_addr[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_addr[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_addr[6]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_addr[7]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_be[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_be[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_be[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_be[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_cs}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_wdata[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_wdata[10]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_wdata[11]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_wdata[12]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_wdata[13]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_wdata[14]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_wdata[15]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_wdata[16]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_wdata[17]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_wdata[18]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_wdata[19]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_wdata[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_wdata[20]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_wdata[21]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_wdata[22]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_wdata[23]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_wdata[24]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_wdata[25]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_wdata[26]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_wdata[27]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_wdata[28]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_wdata[29]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_wdata[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_wdata[30]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_wdata[31]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_wdata[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_wdata[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_wdata[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_wdata[6]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_wdata[7]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_wdata[8]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_wdata[9]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_wr}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reset_n}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_ack}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_rdata[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_rdata[10]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_rdata[11]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_rdata[12]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_rdata[13]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_rdata[14]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_rdata[15]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_rdata[16]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_rdata[17]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_rdata[18]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_rdata[19]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_rdata[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_rdata[20]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_rdata[21]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_rdata[22]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_rdata[23]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_rdata[24]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_rdata[25]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_rdata[26]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_rdata[27]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_rdata[28]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_rdata[29]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_rdata[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_rdata[30]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_rdata[31]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_rdata[3]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_rdata[4]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_rdata[5]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_rdata[6]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_rdata[7]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_rdata[8]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reg_rdata[9]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sar2dac[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sar2dac[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sar2dac[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sar2dac[3]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sar2dac[4]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sar2dac[5]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sar2dac[6]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sar2dac[7]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0729 [get_ports {reg_ack}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[31]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[30]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[29]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[28]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[27]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[26]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[25]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[24]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[23]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[22]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[21]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[20]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[19]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[18]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[17]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[16]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[15]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[14]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[13]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[12]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[11]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[10]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[9]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[8]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[7]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[6]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[5]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[4]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[3]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[2]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[1]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[0]}]
set_load -pin_load 0.0729 [get_ports {sar2dac[7]}]
set_load -pin_load 0.0729 [get_ports {sar2dac[6]}]
set_load -pin_load 0.0729 [get_ports {sar2dac[5]}]
set_load -pin_load 0.0729 [get_ports {sar2dac[4]}]
set_load -pin_load 0.0729 [get_ports {sar2dac[3]}]
set_load -pin_load 0.0729 [get_ports {sar2dac[2]}]
set_load -pin_load 0.0729 [get_ports {sar2dac[1]}]
set_load -pin_load 0.0729 [get_ports {sar2dac[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_dac_out}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_4 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pulse1m_mclk}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_cs}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wr}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reset_n}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_din[5]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_din[4]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_din[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_din[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_din[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {analog_din[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_addr[7]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_addr[6]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_addr[5]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_addr[4]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_addr[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_addr[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_addr[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_addr[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_be[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_be[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_be[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_be[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[31]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[30]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[29]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[28]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[27]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[26]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[25]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[24]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[23]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[22]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[21]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[20]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[19]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[18]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[17]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[16]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[15]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[14]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[13]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[12]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[11]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[10]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[9]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[8]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[7]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[6]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[5]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[4]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 6.0000 [current_design]
set_max_fanout 10.0000 [current_design]
