###############################################################################
# Created by write_sdc
# Tue Oct 31 20:09:03 2023
###############################################################################
current_design serv_rf_top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_clock_latency -source -min 4.6500 [get_clocks {clk}]
set_clock_latency -source -max 5.5700 [get_clocks {clk}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.1900 [get_ports {o_dbus_cyc}]
set_load -pin_load 0.1900 [get_ports {o_dbus_we}]
set_load -pin_load 0.1900 [get_ports {o_ibus_cyc}]
set_load -pin_load 0.1900 [get_ports {o_mdu_valid}]
set_load -pin_load 0.1900 [get_ports {o_dbus_adr[31]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_adr[30]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_adr[29]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_adr[28]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_adr[27]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_adr[26]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_adr[25]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_adr[24]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_adr[23]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_adr[22]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_adr[21]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_adr[20]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_adr[19]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_adr[18]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_adr[17]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_adr[16]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_adr[15]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_adr[14]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_adr[13]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_adr[12]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_adr[11]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_adr[10]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_adr[9]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_adr[8]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_adr[7]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_adr[6]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_adr[5]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_adr[4]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_adr[3]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_adr[2]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_adr[1]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_adr[0]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_dat[31]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_dat[30]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_dat[29]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_dat[28]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_dat[27]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_dat[26]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_dat[25]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_dat[24]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_dat[23]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_dat[22]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_dat[21]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_dat[20]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_dat[19]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_dat[18]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_dat[17]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_dat[16]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_dat[15]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_dat[14]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_dat[13]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_dat[12]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_dat[11]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_dat[10]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_dat[9]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_dat[8]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_dat[7]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_dat[6]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_dat[5]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_dat[4]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_dat[3]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_dat[2]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_dat[1]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_dat[0]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_sel[3]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_sel[2]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_sel[1]}]
set_load -pin_load 0.1900 [get_ports {o_dbus_sel[0]}]
set_load -pin_load 0.1900 [get_ports {o_ext_funct3[2]}]
set_load -pin_load 0.1900 [get_ports {o_ext_funct3[1]}]
set_load -pin_load 0.1900 [get_ports {o_ext_funct3[0]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs1[31]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs1[30]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs1[29]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs1[28]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs1[27]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs1[26]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs1[25]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs1[24]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs1[23]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs1[22]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs1[21]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs1[20]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs1[19]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs1[18]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs1[17]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs1[16]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs1[15]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs1[14]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs1[13]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs1[12]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs1[11]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs1[10]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs1[9]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs1[8]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs1[7]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs1[6]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs1[5]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs1[4]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs1[3]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs1[2]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs1[1]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs1[0]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs2[31]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs2[30]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs2[29]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs2[28]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs2[27]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs2[26]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs2[25]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs2[24]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs2[23]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs2[22]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs2[21]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs2[20]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs2[19]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs2[18]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs2[17]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs2[16]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs2[15]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs2[14]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs2[13]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs2[12]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs2[11]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs2[10]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs2[9]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs2[8]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs2[7]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs2[6]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs2[5]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs2[4]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs2[3]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs2[2]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs2[1]}]
set_load -pin_load 0.1900 [get_ports {o_ext_rs2[0]}]
set_load -pin_load 0.1900 [get_ports {o_ibus_adr[31]}]
set_load -pin_load 0.1900 [get_ports {o_ibus_adr[30]}]
set_load -pin_load 0.1900 [get_ports {o_ibus_adr[29]}]
set_load -pin_load 0.1900 [get_ports {o_ibus_adr[28]}]
set_load -pin_load 0.1900 [get_ports {o_ibus_adr[27]}]
set_load -pin_load 0.1900 [get_ports {o_ibus_adr[26]}]
set_load -pin_load 0.1900 [get_ports {o_ibus_adr[25]}]
set_load -pin_load 0.1900 [get_ports {o_ibus_adr[24]}]
set_load -pin_load 0.1900 [get_ports {o_ibus_adr[23]}]
set_load -pin_load 0.1900 [get_ports {o_ibus_adr[22]}]
set_load -pin_load 0.1900 [get_ports {o_ibus_adr[21]}]
set_load -pin_load 0.1900 [get_ports {o_ibus_adr[20]}]
set_load -pin_load 0.1900 [get_ports {o_ibus_adr[19]}]
set_load -pin_load 0.1900 [get_ports {o_ibus_adr[18]}]
set_load -pin_load 0.1900 [get_ports {o_ibus_adr[17]}]
set_load -pin_load 0.1900 [get_ports {o_ibus_adr[16]}]
set_load -pin_load 0.1900 [get_ports {o_ibus_adr[15]}]
set_load -pin_load 0.1900 [get_ports {o_ibus_adr[14]}]
set_load -pin_load 0.1900 [get_ports {o_ibus_adr[13]}]
set_load -pin_load 0.1900 [get_ports {o_ibus_adr[12]}]
set_load -pin_load 0.1900 [get_ports {o_ibus_adr[11]}]
set_load -pin_load 0.1900 [get_ports {o_ibus_adr[10]}]
set_load -pin_load 0.1900 [get_ports {o_ibus_adr[9]}]
set_load -pin_load 0.1900 [get_ports {o_ibus_adr[8]}]
set_load -pin_load 0.1900 [get_ports {o_ibus_adr[7]}]
set_load -pin_load 0.1900 [get_ports {o_ibus_adr[6]}]
set_load -pin_load 0.1900 [get_ports {o_ibus_adr[5]}]
set_load -pin_load 0.1900 [get_ports {o_ibus_adr[4]}]
set_load -pin_load 0.1900 [get_ports {o_ibus_adr[3]}]
set_load -pin_load 0.1900 [get_ports {o_ibus_adr[2]}]
set_load -pin_load 0.1900 [get_ports {o_ibus_adr[1]}]
set_load -pin_load 0.1900 [get_ports {o_ibus_adr[0]}]
set_input_transition 0.6100 [get_ports {clk}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 3.0000 [current_design]
set_max_fanout 10.0000 [current_design]
