###############################################################################
# Created by write_sdc
# Tue Nov 21 13:56:52 2023
###############################################################################
current_design uart_i2c_usb_spi_top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name app_clk -period 100.0000 [get_ports {app_clk}]
set_clock_transition 0.1500 [get_clocks {app_clk}]
set_clock_uncertainty -setup 0.4000 app_clk
set_clock_uncertainty -hold 0.1000 app_clk
set_propagated_clock [get_clocks {app_clk}]
create_clock -name usb_clk -period 100.0000 [get_ports {usb_clk}]
set_clock_transition 0.1500 [get_clocks {usb_clk}]
set_clock_uncertainty -setup 0.4000 usb_clk
set_clock_uncertainty -hold 0.1000 usb_clk
set_propagated_clock [get_clocks {usb_clk}]
set_clock_groups -name async_clock -asynchronous \
 -group [get_clocks {app_clk}]\
 -group [get_clocks {usb_clk}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {i2c_rstn}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {i2c_rstn}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_addr[0]}]
set_input_delay 2.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_addr[0]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_addr[1]}]
set_input_delay 2.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_addr[1]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_addr[2]}]
set_input_delay 2.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_addr[2]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_addr[3]}]
set_input_delay 2.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_addr[3]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_addr[4]}]
set_input_delay 2.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_addr[4]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_addr[5]}]
set_input_delay 2.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_addr[5]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_addr[6]}]
set_input_delay 2.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_addr[6]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_addr[7]}]
set_input_delay 2.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_addr[7]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_addr[8]}]
set_input_delay 2.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_addr[8]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_be[0]}]
set_input_delay 4.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_be[0]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_be[1]}]
set_input_delay 4.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_be[1]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_be[2]}]
set_input_delay 4.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_be[2]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_be[3]}]
set_input_delay 4.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_be[3]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_cs}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_cs}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_wdata[0]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_wdata[0]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_wdata[10]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_wdata[10]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_wdata[11]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_wdata[11]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_wdata[12]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_wdata[12]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_wdata[13]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_wdata[13]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_wdata[14]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_wdata[14]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_wdata[15]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_wdata[15]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_wdata[16]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_wdata[16]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_wdata[17]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_wdata[17]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_wdata[18]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_wdata[18]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_wdata[19]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_wdata[19]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_wdata[1]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_wdata[1]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_wdata[20]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_wdata[20]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_wdata[21]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_wdata[21]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_wdata[22]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_wdata[22]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_wdata[23]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_wdata[23]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_wdata[24]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_wdata[24]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_wdata[25]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_wdata[25]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_wdata[26]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_wdata[26]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_wdata[27]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_wdata[27]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_wdata[28]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_wdata[28]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_wdata[29]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_wdata[29]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_wdata[2]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_wdata[2]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_wdata[30]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_wdata[30]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_wdata[31]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_wdata[31]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_wdata[3]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_wdata[3]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_wdata[4]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_wdata[4]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_wdata[5]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_wdata[5]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_wdata[6]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_wdata[6]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_wdata[7]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_wdata[7]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_wdata[8]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_wdata[8]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_wdata[9]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_wdata[9]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_wr}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_wr}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {uart_rstn[0]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {uart_rstn[0]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {uart_rstn[1]}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {uart_rstn[1]}]
set_input_delay 1.0000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {usb_rstn}]
set_input_delay 3.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {usb_rstn}]
set_output_delay 0.5000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_ack}]
set_output_delay 1.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_ack}]
set_output_delay 0.5000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_rdata[0]}]
set_output_delay 1.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_rdata[0]}]
set_output_delay 0.5000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_rdata[10]}]
set_output_delay 1.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_rdata[10]}]
set_output_delay 0.5000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_rdata[11]}]
set_output_delay 1.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_rdata[11]}]
set_output_delay 0.5000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_rdata[12]}]
set_output_delay 1.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_rdata[12]}]
set_output_delay 0.5000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_rdata[13]}]
set_output_delay 1.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_rdata[13]}]
set_output_delay 0.5000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_rdata[14]}]
set_output_delay 1.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_rdata[14]}]
set_output_delay 0.5000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_rdata[15]}]
set_output_delay 1.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_rdata[15]}]
set_output_delay 0.5000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_rdata[16]}]
set_output_delay 1.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_rdata[16]}]
set_output_delay 0.5000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_rdata[17]}]
set_output_delay 1.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_rdata[17]}]
set_output_delay 0.5000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_rdata[18]}]
set_output_delay 1.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_rdata[18]}]
set_output_delay 0.5000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_rdata[19]}]
set_output_delay 1.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_rdata[19]}]
set_output_delay 0.5000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_rdata[1]}]
set_output_delay 1.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_rdata[1]}]
set_output_delay 0.5000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_rdata[20]}]
set_output_delay 1.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_rdata[20]}]
set_output_delay 0.5000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_rdata[21]}]
set_output_delay 1.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_rdata[21]}]
set_output_delay 0.5000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_rdata[22]}]
set_output_delay 1.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_rdata[22]}]
set_output_delay 0.5000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_rdata[23]}]
set_output_delay 1.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_rdata[23]}]
set_output_delay 0.5000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_rdata[24]}]
set_output_delay 1.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_rdata[24]}]
set_output_delay 0.5000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_rdata[25]}]
set_output_delay 1.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_rdata[25]}]
set_output_delay 0.5000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_rdata[26]}]
set_output_delay 1.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_rdata[26]}]
set_output_delay 0.5000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_rdata[27]}]
set_output_delay 1.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_rdata[27]}]
set_output_delay 0.5000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_rdata[28]}]
set_output_delay 1.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_rdata[28]}]
set_output_delay 0.5000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_rdata[29]}]
set_output_delay 1.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_rdata[29]}]
set_output_delay 0.5000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_rdata[2]}]
set_output_delay 1.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_rdata[2]}]
set_output_delay 0.5000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_rdata[30]}]
set_output_delay 1.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_rdata[30]}]
set_output_delay 0.5000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_rdata[31]}]
set_output_delay 1.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_rdata[31]}]
set_output_delay 0.5000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_rdata[3]}]
set_output_delay 1.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_rdata[3]}]
set_output_delay 0.5000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_rdata[4]}]
set_output_delay 1.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_rdata[4]}]
set_output_delay 0.5000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_rdata[5]}]
set_output_delay 1.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_rdata[5]}]
set_output_delay 0.5000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_rdata[6]}]
set_output_delay 1.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_rdata[6]}]
set_output_delay 0.5000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_rdata[7]}]
set_output_delay 1.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_rdata[7]}]
set_output_delay 0.5000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_rdata[8]}]
set_output_delay 1.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_rdata[8]}]
set_output_delay 0.5000 -clock [get_clocks {app_clk}] -min -add_delay [get_ports {reg_rdata[9]}]
set_output_delay 1.0000 -clock [get_clocks {app_clk}] -max -add_delay [get_ports {reg_rdata[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0729 [get_ports {i2cm_intr_o}]
set_load -pin_load 0.0729 [get_ports {reg_ack}]
set_load -pin_load 0.0729 [get_ports {scl_pad_o}]
set_load -pin_load 0.0729 [get_ports {scl_pad_oen_o}]
set_load -pin_load 0.0729 [get_ports {sda_pad_o}]
set_load -pin_load 0.0729 [get_ports {sda_padoen_o}]
set_load -pin_load 0.0729 [get_ports {sspim_sck}]
set_load -pin_load 0.0729 [get_ports {sspim_so}]
set_load -pin_load 0.0729 [get_ports {usb_intr_o}]
set_load -pin_load 0.0729 [get_ports {usb_out_dn}]
set_load -pin_load 0.0729 [get_ports {usb_out_dp}]
set_load -pin_load 0.0729 [get_ports {usb_out_tx_oen}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[31]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[30]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[29]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[28]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[27]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[26]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[25]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[24]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[23]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[22]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[21]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[20]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[19]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[18]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[17]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[16]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[15]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[14]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[13]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[12]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[11]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[10]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[9]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[8]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[7]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[6]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[5]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[4]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[3]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[2]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[1]}]
set_load -pin_load 0.0729 [get_ports {reg_rdata[0]}]
set_load -pin_load 0.0729 [get_ports {sspim_ssn[3]}]
set_load -pin_load 0.0729 [get_ports {sspim_ssn[2]}]
set_load -pin_load 0.0729 [get_ports {sspim_ssn[1]}]
set_load -pin_load 0.0729 [get_ports {sspim_ssn[0]}]
set_load -pin_load 0.0729 [get_ports {uart_txd[1]}]
set_load -pin_load 0.0729 [get_ports {uart_txd[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {app_clk}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i2c_rstn}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_cs}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wr}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {scl_pad_i}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sda_pad_i}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_rstn}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sspim_si}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_clk}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_in_dn}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_in_dp}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_rstn}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_addr[8]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_addr[7]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_addr[6]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_addr[5]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_addr[4]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_addr[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_addr[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_addr[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_addr[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_be[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_be[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_be[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_be[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[31]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[30]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[29]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[28]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[27]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[26]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[25]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[24]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[23]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[22]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[21]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[20]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[19]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[18]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[17]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[16]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[15]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[14]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[13]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[12]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[11]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[10]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[9]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[8]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[7]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[6]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[5]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[4]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reg_wdata[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {uart_rstn[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {uart_rstn[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {uart_rxd[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_8 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {uart_rxd[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 5.0000 [current_design]
set_max_capacitance 0.5000 [current_design]
set_max_fanout 20.0000 [current_design]
